Revit 2027 API
ParameterTypeId.StairsSupportHorizontalOffset Property
 "Lateral Offset": Distance from center or edge of boundary
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsSupportHorizontalOffset { get; }
Public Shared ReadOnly Property StairsSupportHorizontalOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsSupportHorizontalOffset {
	ForgeTypeId^ get ();
}
static member StairsSupportHorizontalOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace